package alg;

//数学方法，O(1)，最叼，纸和笔，人的创造性
//机器方法，O(n)等

//重要！！！每种算法需要分析其时空复杂度
//有意识的，条件反射式的，去分析数据总量，算时间空间复杂度，评价好坏
//先暴力穷举，不会错的版本，性能最差，但可以作为基线，用来对拍
//然后感性的，理性的基于这个基版，进行时间空间的优化，往往需要空间换时间，时间换空间，的代价
//然后尽量给出多的具体步骤算法，优化思路和优化方向，尽量到极致，每种步骤算法，尽量分析清楚其时间空间复杂度，比较优劣
//根据实际场景和限制，选取当下最合适的算法，最优算法
//然后根据最优算法进行编码
//编码以后进行细节优化，有io的先从io下手优化，可能要做profiler
//没io的，就开始各种卡常技巧，尽量吧时间空间常数卡到最小，系统优化，系统设计
//最最后，根据计算机硬件，分布式系统，分布式算法，集群系统，集群算法，进行体系优化，并行并发
//这是一个良好的素养素质习惯
class CommonAlgApp {
    public static void main(String[] args) {
        System.out.println("aa");
    }
}


